<?php

use Smetaniny\SmLaravelAdmin\Http\Middleware\DispatchServingSMADMINEvent;
use Smetaniny\SmLaravelAdmin\Http\Middleware\HandleInertiaRequests;

return [
    /*
    |--------------------------------------------------------------------------
    | SMADMIN License Key
    |--------------------------------------------------------------------------
    |
    | Ключ лицензии для SMADMIN. SMADMIN проверяет валидность лицензии на активном домене.
    |
    */
    'license_key' => env('SMADMIN_LICENSE_KEY'),

    /*
    |--------------------------------------------------------------------------
    | SMADMIN App Name
    |--------------------------------------------------------------------------
    |
    | Название вашего приложения, используемое SMADMIN в интерфейсе.
    |
    */
    'name' => env('SMADMIN_APP_NAME', env('APP_NAME')),

    /*
    |--------------------------------------------------------------------------
    | SMADMIN Domain Name
    |--------------------------------------------------------------------------
    |
    | Доменное имя, связанное с вашим приложением. Используется для предотвращения
    | регистрации внутренних маршрутов SMADMIN на субдоменах, которым не нужен доступ
    | к вашему административному приложению.
    |
    */
    'domain' => env('SMADMIN_DOMAIN_NAME', null),


    /*
    |--------------------------------------------------------------------------
    | SMADMIN Authentication Guard
    |--------------------------------------------------------------------------
    |
    | Определение стража аутентификации, который будет использоваться для защиты
    | маршрутов SMADMIN. Этот параметр должен соответствовать одному из стражей
    | аутентификации, определенных в файле конфигурации "auth".
    |
    */
    'guard' => env('SMADMIN_GUARD', null),


    /*
    |--------------------------------------------------------------------------
    | SMADMIN Route Middleware
    |--------------------------------------------------------------------------
    |
    | Middleware, которые будут применяться ко всем маршрутам SMADMIN. Есть
    | возможность добавить свои middleware или изменить существующие.
    |
    */
    'middleware' => [
        'web',
        HandleInertiaRequests::class,
    ],


    /*
    |--------------------------------------------------------------------------
    | SMADMIN Storage Disk
    |--------------------------------------------------------------------------
    |
    | Определение хранилища по умолчанию для файлов, используемых различными
    | полями SMADMIN. Можно использовать любое сконфигурированное хранилище.
    |
    */
    'storage_disk' => env('SMADMIN_STORAGE_DISK', 'public'),
];
